Strogino/src/Documents/УстановкаУчетныхЦенКонтрактов/УстановкаУчетныхЦенКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаУчетныхЦенКонтрактов</name>
  <registerRecords>InformationRegister.УчетныеЦеныНоменклатурыКонтрактов</registerRecords>
  <attributes>
    <name>ДержательКонтракта</name>
    <type>
      <types>CatalogRef.ДержателиКонтракта</types>
    </type>
  </attributes>
  <attributes>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.Контракты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/InformationRegisters/УчетныеЦеныНоменклатурыКонтрактов/УчетныеЦеныНоменклатурыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЦеныНоменклатурыКонтрактов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Strogino/src/Documents/УстановкаУчетныхЦенКонтрактов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Контракт") Тогда
		
		ДержательКонтракта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Контракт, "Владелец");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаУчетныхЦенКонтрактовТовары.Номенклатура,
	|	УстановкаУчетныхЦенКонтрактовТовары.Цена,
	|	УстановкаУчетныхЦенКонтрактовТовары.НомерСтроки КАК НомерСтроки,
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка КАК Регистратор,
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.УстановкаУчетныхЦенКонтрактов.Товары КАК УстановкаУчетныхЦенКонтрактовТовары
	|ГДЕ
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.УчетныеЦеныНоменклатурыКонтрактов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	
	Движения.УчетныеЦеныНоменклатурыКонтрактов.Записать();
	
КонецПроцедуры

#КонецОбласти
